app/Controllers/Blueprints.php

SELECT *
FROM `sedes`
WHERE `estatus` = 1
SELECT *
FROM `planos`
WHERE `habilitado` = 1
SELECT *
FROM `sedes`
WHERE `sedes`.`id` = '17'
---
    public function index()
    {
        // Verificar si el usuario ha iniciado sesión
        $this->verificarSesion();

        // Cargar los modelos necesarios
        $sedeModel = new SedeModel();
        $planoModel = new PlanoModel();

        // Obtener solo las sedes activas (estatus = 1)
        $data['sedes'] = $sedeModel->where('estatus', 1)->findAll();

        // Obtener solo los planos habilitados (habilitado = 1)
        $planos = $planoModel->where('habilitado', 1)->findAll();

        // Procesar las previsualizaciones de los planos
        foreach ($planos as &$plano) {
            $plano['preview_image'] = $this->getPreviewImage($plano);
            // Obtener el nombre de la sede para cada plano
            $sede = $sedeModel->find($plano['sede_id']);

SELECT *
FROM `sedes`
WHERE `estatus` = 1
AND `sedes`.`id` = '38'
SELECT *
FROM `planos`
WHERE `sede_id` = '38'
AND `habilitado` = 1
SELECT *
FROM `trampas`
WHERE `plano_id` = '89'
---
    public function view($id = null)
    {
        if (!$id) {
            return redirect()->to('/blueprints')->with('error', 'Sede no especificada');
        }

        // Cargar modelos
        $sedeModel = new SedeModel();
        $planoModel = new PlanoModel();

        // Obtener información de la sede (solo activas)
        $sede = $sedeModel->where('estatus', 1)->find($id);
        if (!$sede) {
            return redirect()->to('/blueprints')->with('error', 'Sede no encontrada o inactiva');
        }

        // Obtener solo los planos habilitados de la sede
        $planos = $planoModel->where('sede_id', $id)->where('habilitado', 1)->findAll();

        // Obtener el conteo de incidencias por plano
        $db = \Config\Database::connect();
        $trampaModel = new \App\Models\TrampaModel();
        $incidenciaModel = new \App\Models\IncidenciaModel();

        // Procesar las previsualizaciones de los planos y agregar conteo de incidencias
        foreach ($planos as &$plano) {
            $plano['preview_image'] = $this->getPreviewImage($plano);

            // Obtener las trampas del plano
            $trampas = $trampaModel->where('plano_id', $plano['id'])->findAll();

SELECT *
FROM `planos`
WHERE `planos`.`id` = '89'
SELECT *
FROM `sedes`
WHERE `sedes`.`id` = '38'
SELECT *
FROM `trampas`
WHERE `plano_id` = '89'
---
    public function viewplano($id = null)
    {
        if (!$id) {
            return redirect()->to('/blueprints')->with('error', 'Plano no especificado');
        }

        // Cargar modelos
        $planoModel = new PlanoModel();
        $sedeModel = new SedeModel();
        $trampaModel = new \App\Models\TrampaModel();

        // Obtener información del plano
        $plano = $planoModel->find($id);
        if (!$plano) {
            return redirect()->to('/blueprints')->with('error', 'Plano no encontrado');
        }

        // Obtener información de la sede asociada
        $sede = $sedeModel->find($plano['sede_id']);

        // Obtener las trampas desde la base de datos (fuente de verdad)
        $trampas = $trampaModel->where('plano_id', $id)->findAll();