app/Controllers/Home.php

    public function index(): string
    {
        // Cargar los modelos necesarios
        $sedeModel = new SedeModel();
        $trampaModel = new TrampaModel();
        $planoModel = new PlanoModel();

        // Obtener solo las sedes activas (estatus = 1)
        $sedes = $sedeModel->where('estatus', 1)->findAll();

        // Calcular estadísticas para cada sede
        foreach ($sedes as &$sede) {
            $sede['total_planos'] = $planoModel->where('sede_id', $sede['id'])->where('habilitado', 1)->countAllResults();
            $sede['total_trampas'] = $trampaModel->where('sede_id', $sede['id'])->countAllResults();
---
SELECT *
FROM `sedes`
WHERE `estatus` = 1
SELECT COUNT(*) AS `numrows`
FROM `planos`
WHERE `sede_id` = '18'
AND `habilitado` = 1
SELECT COUNT(*) AS `numrows`
FROM `trampas`
WHERE `sede_id` = '18'