app/Controllers/Locations.php

    public function index(): string
    {
        // Verificar si el usuario ha iniciado sesión
        $this->verificarSesion();

        // Agregar logs para depuración
        log_message('debug', 'Iniciando carga de sedes');

        // Cargar el modelo de sedes
        try {
            $sedeModel = new SedeModel();

            // Verificar si la clase SedeModel está completa
            // Obtener solo las sedes activas (estatus = 1)
            $data['sedes'] = $sedeModel->where('estatus', 1)->findAll();
---
SELECT *
FROM `sedes`
WHERE `estatus` = 1

        try {
            // Obtener el total de trampas para la sede
            $builder = $db->table('trampas')->where('sede_id', $sedeSeleccionada);
            $data['totalTrampasSede'] = $builder->countAllResults(false);

            // Obtener el detalle de las trampas (nombre, tipo y ubicación)
            $query = $db->table('trampas')
                ->select('id, id_trampa, nombre, tipo, ubicacion, fecha_instalacion, plano_id')
                ->where('sede_id', $sedeSeleccionada)
                ->get();
---
SELECT COUNT(*) AS `numrows`
FROM `trampas`
WHERE `sede_id` = '38'
SELECT `id`, `id_trampa`, `nombre`, `tipo`, `ubicacion`, `fecha_instalacion`, `plano_id`
FROM `trampas`
WHERE `sede_id` = '38'

            // IMPORTANTE: Filtrar por ambas condiciones: i.sede_id = X AND t.sede_id = X
            if (empty($condicionFecha)) {
                // Sin filtro de fecha
                $query = $db->table('incidencias i')
                    ->select('i.tipo_incidencia, i.tipo_insecto, i.tipo_plaga, SUM(i.cantidad_organismos) as cantidad_organismos, COUNT(*) as total')
                    ->join('trampas t', 'i.id_trampa = t.id', 'inner')
                    ->where('i.sede_id', $sedeSeleccionada)
                    ->where('t.sede_id', $sedeSeleccionada) // Asegurar que la trampa pertenece a la sede seleccionada
                    ->groupBy(['i.tipo_incidencia', 'i.tipo_plaga'])
                    ->get();
---
SELECT `i`.`tipo_incidencia`, `i`.`tipo_insecto`, `i`.`tipo_plaga`, SUM(i.cantidad_organismos) as cantidad_organismos, COUNT(*) as total
FROM `incidencias` `i`
INNER JOIN `trampas` `t` ON `i`.`id_trampa` = `t`.`id`
WHERE `i`.`sede_id` = '38'
AND `t`.`sede_id` = '38'
GROUP BY `i`.`tipo_incidencia`, `i`.`tipo_plaga`

            // Usar INNER JOIN para asegurar que solo se muestren incidencias con trampas válidas de la sede
            if (empty($condicionFecha)) {
                // Sin filtro de fecha
                $query = $db->table('incidencias i')
                    ->select('i.id, i.tipo_incidencia, i.tipo_insecto, i.tipo_plaga, i.cantidad_organismos, i.fecha, t.id_trampa, t.tipo as tipo_trampa, t.plano_id')
                    ->join('trampas t', 'i.id_trampa = t.id', 'inner')
                    ->where('i.sede_id', $sedeSeleccionada)
                    ->where('t.sede_id', $sedeSeleccionada) // Asegurar que la trampa pertenece a la sede seleccionada
                    ->orderBy('i.fecha', 'DESC')
                    ->get();
---
SELECT `i`.`id`, `i`.`tipo_incidencia`, `i`.`tipo_insecto`, `i`.`tipo_plaga`, `i`.`cantidad_organismos`, `i`.`fecha`, `t`.`id_trampa`, `t`.`tipo` as `tipo_trampa`, `t`.`plano_id`
FROM `incidencias` `i`
INNER JOIN `trampas` `t` ON `i`.`id_trampa` = `t`.`id`
WHERE `i`.`sede_id` = '38'
AND `t`.`sede_id` = '38'
ORDER BY `i`.`fecha` DESC

            // IMPORTANTE: Filtrar por ambas condiciones: i.sede_id = X AND t.sede_id = X
            if (empty($condicionFecha)) {
                // Sin filtro de fecha
                $query = $db->table('incidencias i')
                    ->select('i.tipo_incidencia, COUNT(*) as total')
                    ->join('trampas t', 'i.id_trampa = t.id', 'inner')
                    ->where('i.sede_id', $sedeSeleccionada)
                    ->where('t.sede_id', $sedeSeleccionada)
                    ->groupBy('i.tipo_incidencia')
                    ->get();
---
SELECT `i`.`tipo_incidencia`, COUNT(*) as total
FROM `incidencias` `i`
INNER JOIN `trampas` `t` ON `i`.`id_trampa` = `t`.`id`
WHERE `i`.`sede_id` = '38'
AND `t`.`sede_id` = '38'
GROUP BY `i`.`tipo_incidencia`