app/Controllers/RegistroTecnico.php

SELECT *
FROM `quejas`
WHERE `sede_id` = '18'
AND `estado_queja` = 'Pendiente'
ORDER BY `fecha` DESC
---
    private function getQuejasPendientes($sedeId)
    {
        if (!$sedeId) {
            return [];
        }

        // Consulta para obtener las quejas pendientes de la sede
        $quejasPendientes = $this->quejaModel
            ->where('sede_id', $sedeId)
            ->where('estado_queja', 'Pendiente')
            ->orderBy('fecha', 'DESC')
            ->findAll();

SELECT *
FROM `sedes`
WHERE `estatus` = 1
SELECT *
FROM `planos`
WHERE `sede_id` = '18'
AND `habilitado` = 1
---
    public function index()
    {
        // Obtener la sede seleccionada o la primera por defecto
        $sedeSeleccionada = $this->request->getGet('sede_id');
        $sedes = $this->sedesModel->where('estatus', 1)->findAll();

        if (empty($sedeSeleccionada) && !empty($sedes)) {
            $sedeSeleccionada = $sedes[0]['id'];
        }

        // Obtener los planos de la sede seleccionada
        $planos = [];
        if ($sedeSeleccionada) {
            $planos = $this->planoModel->where('sede_id', $sedeSeleccionada)->where('habilitado', 1)->findAll();