app/Controllers/RepositorioController.php

SELECT *
FROM `sedes`
---
    public function index()
    {
        // Verificar si el usuario ha iniciado sesión
        $this->verificarSesion();

        $data['sedes'] = $this->sedeModel->findAll();