app/Models/RepositorioDocumentoModel.php

    public function obtenerUltimosDocumentos($sedeId, $limite = 3)
    {
        return $this->where('sede_id', $sedeId)
            ->orderBy('created_at', 'DESC')
            ->limit($limite)
            ->findAll();
---
SELECT *
FROM `repositorio_documentos`
WHERE `sede_id` = '38'
ORDER BY `created_at` DESC
 LIMIT 3

    public function obtenerDocumentosPorSede($sedeId, $tipo = null, $busqueda = null)
    {
        $builder = $this->where('sede_id', $sedeId);

        if ($tipo && !empty($tipo)) {
            $builder->where('tipo', $tipo);
        }

        if ($busqueda && !empty($busqueda)) {
            $builder->groupStart()
                ->like('titulo', $busqueda)
                ->orLike('descripcion', $busqueda)
                ->groupEnd();
        }

        return $builder->orderBy('created_at', 'DESC')->findAll();
---
SELECT *
FROM `repositorio_documentos`
WHERE `sede_id` = '38'
ORDER BY `created_at` DESC